{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "batch_input_shape": [null, 128, 128, 3], "name": "conv2d_1", "use_bias": true, "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"center": true, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "activity_regularizer": null, "name": "conv2d_2", "use_bias": true, "filters": 64, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"center": true, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "activity_regularizer": null, "name": "conv2d_3", "use_bias": true, "filters": 64, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"center": true, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "activity_regularizer": null, "name": "conv2d_4", "use_bias": true, "filters": 96, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_4", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"center": true, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "padding": "valid", "activity_regularizer": null, "name": "conv2d_5", "use_bias": true, "filters": 32, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_5", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"center": true, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true, "rate": 0.3}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "softmax", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_2", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 25, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}], "keras_version": "2.2.2", "backend": "tensorflow"}